<?php

// +----------------------------------------------------------------------
// | 缓存设置
// +----------------------------------------------------------------------

return [
    // 默认缓存驱动
    'default' => 'redis',

    // 缓存连接方式配置
    'stores' => [
        'file' => [
            // 驱动方式
            'type' => 'File',
            // 缓存保存目录
            'path' => '',
            // 缓存前缀
            'prefix' => '',
            // 缓存有效期 0表示永久缓存
            'expire' => 0,
            // 缓存标签前缀
            'tag_prefix' => 'tag:',
            // 序列化机制 例如 ['serialize', 'unserialize']
            'serialize' => [],
        ],
        // Redis 缓存配置
        'redis' => [
            'type' => 'redis',      //类型
            'host' => '127.0.0.1',  // Redis 服务器地址
            'port' => 6379,         // Redis 服务端口
            'password' => '',           // Redis 密码，没有则留空
            'select' => 0,            // 使用的 Redis 数据库编号（0-15）
            'timeout' => 0,            // 连接超时时间（秒），0 表示不限制
            'expire' => 0,            // 默认缓存有效期（秒），0 表示永久
            'prefix' => '',           // 缓存键前缀，用于避免不同应用键名冲突
            'persistent' => false,        // 是否启用长连接，高并发时建议开启[citation:4][citation:6]
        ],
        // 更多的缓存连接
    ],
];
